[
    {
        "title": "Thank you to all our contributors",
        "description": "Thank you to all our contributors!",
        "text": "Contributors Thank you to everyone who helps build and support Respond. Gun Rodeo: High Caliber Technology http:\/\/www.gun.rodeo The first Online Community built specifically for supporters of the 2nd Amendment. Unlike other platforms, we don't ban our members for posting a picture of a gun. Alistair \"Accudio\" Shepherd http:\/\/accudiodesign.com",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "contributors",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Respond Demo",
        "description": "Try out Respond using our demo",
        "text": "Demo The Respond demo walks you through the process of creating and modifying a site with Respond.&nbsp; It is meant to give you a glimpse of what it is like to use Respond as an end user. Start the Respond Demo If you want a personalized tour of Respond, reach out using our&nbsp;contact form.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "demo",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Developer Experience ",
        "description": "Learn how Respond makes development easy.",
        "text": "Developer Experience Inevitably, your client is going to ask to maintain all or portion of their site. And, you have to make a decision. Do I spend hours converting my site to some obscure CMS theme format? Do I give up on code quality and my curated build tools?&nbsp;",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "developer-experience",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Build Options",
        "description": "Learn about the gulp build options available to Respond.",
        "text": "Build Options Respond uses gulp to perform builds for the application. This references covers the build options available to Respond 6. Repo Description gulp The default build performs all actions necessary to deploy the application to production. It copies library files from the node_modules directory (installed by NPM) to the public\/app\/libs directory. It then copies the static HTML and image files from public\/src to public\/app. It then runs the Typescript compiler and bundles the application using the SystemJS builder. gulp dev-build Used to debug code changes when using the systemjs loader. Copies the static files from public\/src to public\/app and runs the Typescript compiler. gulp build Used to debug code changes using the production bundles. Copies the static files from public\/src to public\/app and runs the Typescript compiler. I then bundles the application using the SystemJS builder. gulp zip ZIPS the code and places it in dist\/release.zip.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/build-options",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Creating Plugins",
        "description": "Learn how to create plugins for Respond",
        "text": "Creating Plugins Plugins are a great way to extend Respond to meet the needs of your users.&nbsp; In Respond 7, plugins are managed globally and distributed to sites when you create the site or when you update the plugins from the advanced menu.&nbsp; Updating Plugins You can find the source code for the existing plugins in the \/resources\/plugins\/ folder.&nbsp; When you create your site with Respond, the sites theme folder will be copied over to your installation folder (\/public\/sites\/site-name) and then the \/resources\/plugins folder will be copied over to the site.&nbsp;&nbsp; To update the plugins, you simply update the code in this folder and then create a new site or update the plugins from the advanced menu \"Advanced &gt; Update Plugins\".Referencing Plugins in Code The respond-plugin attribute is used to tell the system that the code contained within an element is generated by a plugin. &lt;div respond-plugin type=\"form\" form=\"contact-us\"&gt;&lt;\/div&gt; In the above example, the plugin is set to a type of form. This tells Respond to pull the code from public\/sites\/site-name\/plugins\/form.html. Enabling Plugins in the Respond Editor You can enable the Respond visual editor to show your plugin by adding the following JSON to \/resources\/plugins\/data\/plugins.json. The file is copied to public\/sites\/site-name\/data\/plugins.json when the site is created.&nbsp; Once again, changing this file will not affect existing sites until you update the plugins from the advanced menu. { \"selector\": \"[respond-plugin][type=form]\", \"title\": \"Form\", \"display\": \"&lt;i class=\\\"material-icons\\\"&gt;check_box&lt;\/i&gt;\", \"view\": \"&lt;div class=\\\"respond-plugin\\\"&gt;&lt;i class=\\\"material-icons\\\"&gt;check_box&lt;\/i&gt;&lt;span&gt;Form&lt;\/span&gt;&lt;\/div&gt;\", \"html\": \"&lt;div respond-plugin type=\\\"form\\\" form=\\\"contact-us\\\"&gt;&lt;\/div&gt;\", \"attributes\": [ { \"attr\": \"form\", \"label\": \"Form\", \"type\": \"select\", \"values\": [\"respond.forms\"] } ], \"assets\": [\"plugins\/form.html\"] } Setting Description action A unique identifier for your plugin. selector The CSS selector by which your plugin can be accessed by the editor. Typically, this will be [respond-plugin][type=plugin] where plugin is the name of your plugin. title The title of the plugin. Shown when the icon is hovered over. display The HTML display of the icon shown in the toolbar in the Respond editor. view (optional) Specifies \"default\" HTML that is replaced by the editor. This is recommended when the plugin contains dynamic data that should not be edited by the user. attributes The attributes allow you to configure the configure modal for the plugin. Each configurable item is mapped to an attribute on the plugin HTML. For example, in the form plugin, the form attribute sets the form attribute in the plugin HTML. More on Attributes Attributes are the primary means to pass data from the user to the plugin. They can pass plain text or specify the name of the form, gallery, or page to be used by the plugin. Setting Description attr The name of the HTML attribute to be set on the plugin. label The label for the field shown in the configure element modal type This can be set to text or select to show a text field or select field. values (if select is set as type) An array of values to be added on the select list. This can be a simple array of strings (e.g. ['Option 1','Option 2','Option 3']) or can be set as ['respond.forms'], ['respond.galleries'], ['respond.routes'], or ['respond.pages']. These special values automatically populate the select box with items created in Respond. Plugin Structure Plugins can be a simple as creating plain HTML. In fact, you can just specify the HTML in the plugins.json file. However, to get the full power of accessing Respond data, you need to use TWIG templates. The Twig templates allow you to access data in the system. An example of the form plugin is shown below. {% spaceless %} {% for form in forms %} {% if form.id == attributes.form %} &lt;form id=\"{{ form.id }}\" action=\"{{ site.api }}\" data-site=\"{{ site.id }}\" respond-form&gt; {% for field in form.fields %} &lt;div class=\"form-group\" data-id=\"{{ field.id }}\" data-label=\"{{ field.label }}\" data-type=\"{{ field.type }}\" data-required=\"{{ field.required }}\"&gt; &lt;label for=\"{{ field.id }}\" class=\"control-label\"&gt;{{ field.label }}&lt;\/label&gt; {% if field.type == 'text' %} &lt;input id=\"{{ field.id }}\" name=\"{{ field.id }}\" type=\"text\" placeholder=\"{{ field.placeholder }}\" class=\"form-control\"&gt; {% endif %} {% if field.type == 'textarea' %} &lt;textarea id=\"{{ field.id }}\" name=\"{{ field.id }}\" placeholder=\"{{ field.placeholder }}\" class=\"form-control\"&gt;&lt;\/textarea&gt; {% endif %} {% if field.type == 'select' %} {% set options = field.options|split(',') %} &lt;select id=\"{{ field.id }}\" name=\"{{ field.id }}\" class=\"form-control\"&gt; {% for option in options %} &lt;option value=\"{{ option }}\"&gt;{{ option }}&lt;\/option&gt; {% endfor %} &lt;\/select&gt; {% endif %} {% if field.type == 'checkboxlist' %} {% set options = field.options|split(',') %} &lt;span class=\"radio list\"&gt; {% for option in options %} &lt;label class=\"radio\"&gt;&lt;input name=\"{{ field.id }}\" type=\"checkbox\" value=\"{{ option }}\"&gt;&lt;span&gt;{{ option }}&lt;\/span&gt;&lt;\/label&gt; {% endfor %} &lt;\/span&gt; {% endif %} {% if field.type == 'radiolist' %} {% set options = field.options|split(',') %} &lt;span class=\"checkbox list\"&gt; {% for option in options %} &lt;label class=\"checkbox\"&gt;&lt;input name=\"{{ field.id }}\" type=\"radio\" value=\"{{ option }}\"&gt;&lt;span&gt;{{ option }}&lt;\/span&gt;&lt;\/label&gt; {% endfor %} &lt;\/span&gt; {% endif %} {% if field.helperText != '' %} &lt;span class=\"help-block\"&gt;{{ field.helperText }}&lt;\/span&gt; {% endif %} &lt;\/div&gt; {% endfor %} {% endif %} {% endfor %} &lt;button type=\"submit\" class=\"btn btn-primary\"&gt;Submit&lt;\/button&gt; &lt;span class=\"loading\"&gt; &lt;!-- ack: https:\/\/github.com\/jxnblk\/loading --&gt; &lt;svg xmlns=\"http:\/\/www.w3.org\/2000\/svg\" viewBox=\"0 0 32 32\"&gt;&lt;g&gt;&lt;path opacity=\".25\" d=\"M16 0 A16 16 0 0 0 16 32 A16 16 0 0 0 16 0 M16 4 A12 12 0 0 1 16 28 A12 12 0 0 1 16 4\"\/&gt;&lt;path d=\"M16 0 A16 16 0 0 1 32 16 L28 16 A12 12 0 0 0 16 4z\"&gt;&lt;animateTransform attributeName=\"transform\" type=\"rotate\" from=\"0 16 16\" to=\"360 16 16\" dur=\"0.8s\" repeatCount=\"indefinite\" \/&gt;&lt;\/path&gt;&lt;\/g&gt;&lt;\/svg&gt; &lt;\/span&gt; &lt;span class=\"success\"&gt;Form submitted successfully&lt;\/span&gt; &lt;span class=\"error\"&gt;There was an error submitting your form&lt;\/span&gt; &lt;\/form&gt; {% endspaceless %} Form Data Forms are created in the Forms UI in Respond. The following data is passed into the forms array passed to your plugin. Setting Description id The ID of the created form. name The name of the form. cssClass This CSS class of the form. fields An array of fields created on the form. Fields contain the following information. Setting Description id The ID of field label The label of the field. type This type of the field (text, textarea, select, checkboxlist, radiolist) required Set to \"true\" or \"false\" if the field is required. options A comma separated list of options available to the select, checkboxlist or radiolist types. helperText Any helper text set on the form field. placeholder The placeholder text set on text fields. cssClass The CSS class for the field. Gallery Data Galleries are created in the Galleries UI in Respond. The following data is passed into the galleries array passed to your plugin. Setting Description id The ID of the created gallery. name The name of the gallery. images An array of images created on the gallery. Images contain the following information. Setting Description id The generated id for the image. name The filename of the image. url The relative URL to the image. thumb The relative URL to the thumb of the image. caption A user-specified caption for the image. Menu Data Menus are created in the Menus UI in Respond. The following data is passed into the menus array passed to your plugin. Setting Description id The ID of the created menu. name The name of the menu. items An array of menu items created on the menu. The items contain the following information. Setting Description cssClass The css class for the menu item isNested Set to \"true\" or \"false\" as to whether the menu item is nested in the parent. html The HTML to be displayed in the menu item label. url The relative URL to which the menu item is linked. Pages Data Pages are created in the Pages UI in Respond. The following data is passed into the pages array passed to your plugin. Setting Description title The title of the page. description The description of the page. text Plain text for the main content in the page. html The HTML for the main content in the page. keywords Keywords for the page. callout Callout text for the page. url The relative URL of the page. photo The relative photo URL for the first image in the main content of the page. thumb The relative thumb URL for the first image in the main content of the page. language The language of the page. direction The direction (rtl or ltr) of text on the page. firstName The first name of the last user to modify the page. lastName The last name of the last user to modify the page. lastModifiedBy The email of the last user to modify the page. lastModifiedDate The date of the last modification to the page (e.g. 2016-06-09T19:49:27.0Z). Current Page Data The following data is passed into the page array passed to your plugin. It contains information about the current page. Setting Description title The title of the page. description The description of the page. keywords Keywords for the page. callout Callout text for the page. url The relative URL of the page. photo The relative photo URL for the first image in the main content of the page. thumb The relative thumb URL for the first image in the main content of the page. language The language of the page. direction The direction (rtl or ltr) of text on the page. firstName The first name of the last user to modify the page. lastName The last name of the last user to modify the page. lastModifiedBy The email of the last user to modify the page. lastModifiedDate The date of the last modification to the page (e.g. 2016-06-09T19:49:27.0Z). Products Data Products are created in the Products UI in Respond. The following data is passed into the products array passed to your plugin. Setting Description id The ID of the created product. name The name of the product. url The url of the product. description The description of the product. shipped Whether the product is shipped (true or false). subscription Whether the product is a subscription (true or false). price The price of the product images The images of the product (attributes: id, name, url, thumb, caption) Current Site Data The following data is passed into the site array passed to your plugin. It contains information about the current site. Setting Description id The unique id (also the folder name) for the site. name The name of the site (when created). email The primary email of the site. api The URL to the API for the app.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/creating-plugins",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Creating themes",
        "description": "Learn how to create themes for Respond.",
        "text": "Creating Themes Respond 7 makes it easier than ever to create themes. In Respond, we like to say that Respond uses \"sites as themes\". This is because our themes are just standalone sites. They can be viewed in the browser without modification. In fact, when Respond creates a site, it simply copies the theme folder's contents over to the site's production folder. With that said, Respond does require the HTML to follow the bootstrap grid framework to be editable, and Respond relies on a few key components. That is why we believe the best way to create a theme is to copy an existing one and customize it to meet your needs. Existing themes can be found in your installation folder at public\/themes. You can simply copy the theme and update the folder name and the theme.json file with your theme's name and description. Now that you have a solid framework for creating your own themes, the rest of this documentation will walk you through the components of a theme and describe some best best practices that we follow when creating our own themes. Theme Components Themes consist of: (1) the HTML, CSS, and JS content of the theme, (2) the theme.json file, (3) the screenshot.png file and (4) the templates. The HTML, CSS, and JS content of the theme, The theme HTML, CSS, and JS is easily recognizable if you have developed a website before. Respond uses Bootsrap 4 to style its themes. You can use other frameworks, but that is out of the scope of this document. A subset of the theme code is shown below for demonstration purposes.&nbsp; We recommend that you structure documents with header, main, and footer elements.&nbsp; The header and footer are hidden in the editor by default.&nbsp; And, the main element should hold the editable content of your page.&nbsp; The main element should also have a role=\"main\" attribute.&nbsp; This attribute is key for editing and saving content.The content in the role=\"main\" element should also be set in the Bootstrap 4 grid with the .content, .row, .col nesting.&nbsp; This nesting enables elements in the .col block to be sortable.&lt;header role=\"banner\"&gt; ... &lt;\/header&gt; &lt;main class=\"content\" role=\"main\"&gt; &lt;div class=\"block row jumbotron\"&gt; &lt;div class=\"col col-md-12\"&gt; &lt;h1&gt;Beautiful themes built for speed&lt;\/h1&gt; &lt;p&gt;Take your idea from concept to completion faster by starting with our beautiful, responsive themes.&lt;\/p&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/main&gt; &lt;footer&gt; ... &lt;\/footer&gt; The theme.json file The theme.json file is found at&nbsp;public\/themes\/theme-name\/theme.json. &nbsp;The role of this file is to provide Respond with meta data to display when creating your theme. { \"name\": \"Aspire\", \"desc\": \"Aspire is a bold, mobile-first design built to push your site forward.\" } Setting Description name The name of the theme. desc The description of the theme. Templates Templates hold the content that is used to create new pages and provide common headers and footers across pages. You can find the templates in the public\/themes\/theme-name\/templates\/ folder in your sites directory. Templates have their own unique syntax to inject common settings into your page. To change page settings, you use the settings in the page settings modal. Setting Description {{page.title}} The title of the page. {{page.description}} The description of the page. {{page.keywords}} The keywords of the page. {{page.tags}} The tags of the page. {{page.callout}} A short phrase to call attention to a page. {{page.url}} The url of the page (not editable in page settings). {{page.fullUrl}} The full url of the page (not editable in page settings). {{page.photoUrl}} The url of the selected photo for the page. {{page.fullPhotoUrl}} The full url of the selected photo for the page. {{page.thumbUrl}} The thumb url of the selected photo for the page. {{page.fullThumbUrl}} The thumb url of the selected photo for the page. {{page.language}} The selected language for the page. {{page.direction}} The text direction (ltr, rtl) for the page.. {{page.customHeader}} Custom HTML for the header of the page. {{page.customFooter}} Custom HTML for the footer of the page. Theme Best Practices BASE element Respond adds all links and images relative to the root of the site. As a result, pages in the theme must specify a base element relative to the root. For instance, pages in a \/page\/ subdirectory must have a base of &lt;base href=\"..\/\"&gt;. Sortable ellements must be positioned static or relative. These elements cannot be floated. Immediate children of sortable containers (see settings) must be positioned relative or static. They cannot be floated or positioned absolute. However, children of those children do not have that restriction. Specify a [role=\"main\"] One element on the page should be given a role=\"main\" attribute. Respond uses this as the main content of the page. This main content is searchable and added to the pages.json file so that it can be made available to plugins. Installing a theme Simply place the theme folder in resources\/themes.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/creating-themes",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Developer Tools",
        "description": "Learn about the developer tools available within Respond",
        "text": "Developer Tools You can access the developer tools available to your site through the \/developer route in your app. Just login to your site and update your url with the \/developer route (e.g. https:\/\/app.myrespond.com\/developer). Tool Description Re-publish Plugins This tool walks through the pages in your site and re-publishes the plugins on each page. It does this by querying the DOM for the [respond-plugin] attribute and then updates the element with content from the associated plugin. This is helpful when developing or modifying plugins for your site. An error when executing this function typically means you have an error in your plugin. Re-index Pages This tool updates the current index (data\/pages.json) with new files in your site's directory. The tool also updates your sitemap.xml file. This tool allows you to bring in pages into Respond that you develop outside of the CMS. Re-publish Sitemap This tool updates your sitemap.xml file (but does not reindex your pages). Migrate Respond 5 site This tool aids in the process of migrating your site from Respond 5 to 6. More details below. R5 Migration Tool While the R5 migration tool does not completely move your site from R5 to R6, it does much of the heavy lifting. A list is outlined below: Removes web component JS Removes respond-language, respond-language-toggle, respond-cart, respond-cart-toggle, and respond-search tags Updates the respond-map tag with the R6 equivalent Updates the respond-html tag with the R6 equivalent Updates the respond-video tag with the R6 equivalent Updates the respond-gallery tag with the R6 equivalent Updates the respond-menu tag with the R6 equivalent Updates the respond-form tag with the R6 equivalent Updates the respond-list [type=blog] tag with the R6 equivalent Sets the [nav] element in the header to the primary R6 menu Removes [data-i18n] attributes Removes [data-nested] attributes Removes [data-backgroundimage] attributes Removes [data-backgroundstyle] attributes Removes [data-containerid] attributes Removes [data-containercssclass] attributes Removes [page] attributes Removes absolute links to images Publishes R6 plugins",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/developer-tools",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Enabling Facebook Open Graph Tags",
        "description": "Learn how to enable Facebook's Open Graph (OG) tags in Respond.",
        "text": "",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/facebook-open-graph",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Enabling Friendly URLs in your application",
        "description": "Learn how to enable friendly URLs in your application",
        "text": "Enabling Friendly URLs for your site By default, Respond 6 references pages using their .html extension. This is done in both the menu and links created in the application. However, you can enable friendly URLs by changing the FRIENDLY_URLS property in your .env file to true. You will still need to make sure friendly URLs are supported by your server. Sample .htaccess A sample .htaccess is shown below for Apache servers. This is typically placed in the root of your site\/site-name folder. Options -Indexes &lt;IfModule mod_rewrite.c&gt; RewriteEngine On RewriteCond %{REQUEST_FILENAME} !-f RewriteRule ^([^\\.]+)$ $1.html [NC,L] ErrorDocument 404 \/page\/error &lt;\/IfModule> &lt;IfModule mod_expires.c&gt; ExpiresActive On ExpiresDefault \"access plus 1 month\" ExpiresByType image\/x-icon \"access plus 1 year\" ExpiresByType image\/gif \"access plus 1 month\" ExpiresByType image\/png \"access plus 1 month\" ExpiresByType image\/jpg \"access plus 1 month\" ExpiresByType image\/jpeg \"access plus 1 month\" ExpiresByType text\/css \"access 1 month\" ExpiresByType application\/javascript \"access plus 1 year\" &lt;\/IfModule&gt;",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/friendly-urls",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Enabling Google Maps",
        "description": "Learn how to use Google Maps from within Respond.",
        "text": "Enabling Google Maps Google Maps requires an API key to utilize its service. This guide will walk you through obtaining a license key and adding it to Respond. Obtaining a license key Google provides documentation on obtaining a license key. You can view their documentation on the Google maps site. You should create your key and restrict its use to specific IPs or domains. Restricting API Key use When restricting your key make sure to provide the production and development URL so that it works both on your site and from within the Respond app. Adding your API Key to Respond Once you have your key, navigate to the Code portion of your site and select your templates. For each template, replace the add your key to the Google maps script. Clicking the \"Save\" button will push this key to all your pages that inherit from the template. &lt;script src=\"https:\/\/maps.googleapis.com\/maps\/api\/js?key=YOUR_API_KEY type=\"text\/javascript\"&gt;&lt;\/script&gt;",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/google-maps",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Gulp Recipes",
        "description": "Learn about the gulp build options available to Respond.",
        "text": "Gulp Recipes Respond uses Gulp to optimize sites for deployment. This includes packaging the CSS and JS by concatenating and minifying dependencies. This works great for fast sites, but if you want to modify themes you will want to roll your own Gulp scripts to match your workflow. I have included the Gulp recipes I use below so that you can modify them for your use. Packaging CSS \/\/ cleanup files gulp.task('cleanup', function() { var x; \/\/ walk through the themes for(x=0; x&lt;themes.length; x++) { console.log(themes[x]); \/\/ concat css gulp.src([themes[x] + '\/css\/libs.min.css', themes[x] + '\/css\/plugins.css', themes[x] + '\/css\/site.css']) .pipe(concat('site.all.css')) .pipe(minifyCss()) .pipe(rename('site.min.css')) .pipe(gulp.dest(themes[x] + '\/css')); } return; }); Prettify HTML \/\/ prettify html (as needed) gulp.task('prettify', function() { gulp.src('temp\/**\/*.html') .pipe(prettify({indent_size: 2})) .pipe(gulp.dest(themes[x])); });",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/gulp-recipes",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Install on Digital Ocean",
        "description": "Learn how to install Respond on a Digital Ocean droplet with this step-by-step tutorial.",
        "text": "Install On Digital Ocean Support Respond! You can support the development of Respond 6 by using our Digital Ocean referral Code. This helps us pay for hosting. This tutorial will walk you step-by-step through installation on Digital Ocean. Create Digital Ocean Account 1. Start by creating your account on Digital Ocean. &nbsp;Use our referral code to support the project. 2. Key a hostname (e.g. respondcms.com), select a size for your installation, and select a region. 3. Select Applications -&gt; LAMP on Ubuntu 14.04. &nbsp;You could do this manually, but this speeds up the process. 4. Your will receive a password via email to SSH into your account. &nbsp;It is recommended you change this to an SSH key later. 5. You should now have a basic LAMP install, but it is good form to double check&nbsp;Digital Ocean's guide on setting up and securing the installation. Install mcrypt, git, curl php5enmod mcrypt apt-get install php5-curl apt-get install git service apache2 restart Enable Mod_Rewrite 1. Enable mod_rewrite extension sudo a2enmod rewrite 2. Open&nbsp;\/etc\/apache2\/apache2.conf via SSH or an editor using SFTP.&nbsp;Set AllowOverride to All. Options Indexes FollowSymLinks AllowOverride All Require all granted 3. Restart Apache (service apache2 restart) Install Respond Follow the instructions to Install Respond from ZIP or Install Respond from Github. Setup your domains 1. Point a domain or subdomain to your installation directory. &nbsp;This is done in Apache 2.4 by creating a configuration file at etc\/apache2\/sites-available\/app.myrespond.com.conf. &lt;VirtualHost *:80&gt; ServerAdmin admin@myrespond.com ServerName app.myrespond.com DocumentRoot \/var\/www\/html\/respond\/app\/public ErrorLog ${APACHE_LOG_DIR}\/error.log CustomLog ${APACHE_LOG_DIR}\/access.log combined &lt;\/VirtualHost&gt; # vim: syntax=apache ts=4 sw=4 sts=4 sr noet 2. You can optionally&nbsp;setup wildcard subdomains or individual subdomains for the sites you create. &nbsp;Follow our tutorial on&nbsp;Setting up Wildcard subdomains&nbsp;to setup wildcard subdomains. Create your first site 1. If all goes well you should be able to create your first site at: &nbsp;http:\/\/your_url\/create. &nbsp;Note: the default passcode is \"iloverespond\". This can be changed in your .env file or removed if you set it to blank.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/install-on-digital-ocean",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Development Installation",
        "description": "Learn how to install Respond to start developing on the system.",
        "text": "Development Installation Support Respond! You can support the development of Respond 6 by using our Digital Ocean referral Code. This helps us pay for hosting. Are you ready to get started developing with Respond? Learn how to install Respond on a traditional LAMP deployment and setup UI development using the Angular CLI.&nbsp;Quick Note: This installation process is built to enable fast development for Respond, and as such, assumes you have basic understanding of Laravel, PHP, and the Angular CLI. &nbsp;If these are new concepts, spend some time reading up on them before moving forward. 1. Create the directory structure for Respond You create your directory structure by navigating to your web root and creating folders for Respond. You can also do this using a graphical tool (such as sFTP). Below we are creating the following structure: var\/www\/html\/respond\/app. We are also adding a var\/www\/html\/respond\/app\/public\/sites folder that will hold the sites and a var\/www\/html\/respond\/app\/resources\/sites folder that will hold private data about your sites. \/\/ go to your HTML root cd var\/www\/html \/\/ create the respond directory mkdir respond \/\/ switch directories cd respond \/\/ create a directory to hold the app and sites mkdir app \/\/ change to the app directory cd app 2. Pull the repository and add dependencies Pull the repository into the app folder. git clone https:\/\/github.com\/madoublet\/respond . \/\/ install front-end dependencies (angular, hashedit, etc) npm install \/\/ install composer (see https:\/\/getcomposer.org\/download\/) php -r \"copy('https:\/\/getcomposer.org\/installer', 'composer-setup.php');\" php -r \"if (hash_file('SHA384', 'composer-setup.php') === 'e115a8dc7871f15d853148a7fbac7da27d6c0030b848d9b3dc09e2a0388afed865e6a3d6b3c0fad45c48e2b5fc1196ae') { echo 'Installer verified'; } else { echo 'Installer corrupt'; unlink('composer-setup.php'); } echo PHP_EOL;\" php composer-setup.php php -r \"unlink('composer-setup.php');\" \/\/ run composer to install PHP dependencies php composer.phar install --prefer-dist --no-dev\/\/ run gulp (this copies all the dependencies into their appropriate places) gulp 3. Make the sites directories Make the folders that store the sites public and private data. This is typically done by making Apache the owner of the directory. You can also set read-write permissions (e.g. 755) on the folder. Contact your hosting provider about the correct permissions for writeable directories. \/\/ make sites directory in app (app\/public\/sites) mkdir public\/sites \/\/ make sites directory in app (app\/resources\/sites) mkdir resources\/sites \/\/ make the directories writeable chown -R www-data public\/sites chown -R www-data resources\/sites 4. Setup env Copy the env file. You can set this up later to specify email and other settings. \/\/ switch to app directory cp .env.example .env 5. Map domains We recommend you setup a domain for your application and a sub-domain (or domain) for each of your sites. This allows you to secure your application using https and provide nice URLs for sites created using the CMS. Domains are typically setup using DNS and your htdocs file. Refer to your hosting provider's documentation on setting up domains. For installs that will host multiple sites, we have created a guide for installing wildcard DNS based on our Digital Ocean setup. ...\/respond ...\/respond\/app\/public -&gt; https:\/\/app.myrespond.com ...\/respond\/app\/public\/sites\/mysite -&gt; https:\/\/mysite.myrespond.com or https:\/\/app.myrespond.com\/sites\/my-site 6. Test installation Navigate to https:\/\/app.myrespond.com\/install (where app.myrespond.com is your installation URL) to test your installation. 7. Setup Respond UI Setup front-end development for Respond using the Angular CLI. Get started here.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/installation-from-github",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Installing Respond Locally on Mac or PC using Vagrant",
        "description": "Learn how to install Respond locally on your Mac or PC using Vagrant",
        "text": "",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/installation-local",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Installing Respond",
        "description": "Learn how to install Respond. ",
        "text": "Installation Learn how to install Respond on a LAMP setup Installation is included with Respond 7. But, if you are the DIY type or you just want to see how it works, you can learn how to install Respond on a traditional LAMP deployment. Before we get started, read about the server requirements. If you are an experience developer, you might also want to checkout out our documentation on installing the app from Github. This requires a little more work but gives you a number of long-term benefits. 1. Create the directory structure for Respond You create your directory structure by navigating to your web root and creating folders for Respond. You can also do this using a graphical tool (such as sFTP). Below we are creating the following structure: var\/www\/html\/respond\/app. The zip will go in the app folder. \/\/ go to your HTML root cd var\/www\/html \/\/ create the install directory mkdir respond \/\/ switch directories cd respond \/\/ create a directory to hold the app and sites mkdir app 2. Copy ZIP to app folder Copy the provided zip to your respond directory. You can use an sFTP client or the command line. \/\/ install unzip (if not already installed). The command below uses apt-get. Your package manager may vary. sudo apt-get install unzip \/\/ unzip it into the app directory unzip release.zip -d app 3. Make the two sites directories We are also adding a var\/www\/html\/respond\/app\/public\/sites folder that will hold the sites and a var\/www\/html\/respond\/app\/resources\/sites folder that will hold private data about your sites. We are then giving the app permission to write to these directoriesThis is typically done by making Apache the owner of the directory. You can also set read-write permissions (e.g. 755) on the folder. Contact your hosting provider about the correct permissions for writeable directories. \/\/ make sites directory in app (app\/public\/sites) mkdir app\/public\/sites \/\/ make sites directory in app (app\/resources\/sites) mkdir app\/resources\/sites \/\/ make the directories writeable chown -R www-data app\/public\/sites chown -R www-data app\/resources\/sites 4. Setup env Copy the env file. You can set this up later to specify email and other settings. \/\/ switch to app directory cp app\/.env.example app\/.env 5. Map domains We recommend you setup a domain for your application and a sub-domain (or domain) for each of your sites. This allows you to secure your application using https and provide nice URLs for sites created using the CMS. Domains are typically setup using DNS and your htdocs file. Refer to your hosting provider's documentation on setting up domains. For installs that will host multiple sites, we have created a guide for installing wildcard DNS based on our Digital Ocean setup. ...\/respond ...\/respond\/app\/public -> https:\/\/app.myrespond.com ...\/respond\/app\/public\/sites\/mysite -> https:\/\/mysite.myrespond.com or https:\/\/app.myrespond.com\/sites\/my-site 6. Test installation and Create your first site. Navigate to https:\/\/app.myrespond.com\/install (where app.myrespond.com is your installation URL) to test your installation. Then create your first site at https:\/\/app.myrespond.com\/create. Note: the default passcode is \"iloverespond\". This can be changed in your .env file or removed if you set it to blank.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/installation",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Migrating from Respond 5 to Respond 6",
        "description": "Learn how to migrate a site from Respond 5 to Respond 6.",
        "text": "Migrating from Respond 5 to Respond 6 Respond is a complete overhaul of the system, but you can transition a site created in R5 to R6. In fact, we transitioned this site to use the new system. 1. Create a new site in R6 using the Blank template Start by creating a new, blank site in R6. This will give you the structure you need to get started. We recommend using the theme that best matches your current theme or the basic Bootstrap theme to start. If you previously purchased a theme in R5, just send me an email at matt@matthewsmith.com, and I will send you the current version (if available). 2. Copy your R5 site to R6 Copy the contents of your R5 site to your R6 sites folder (e.g. sites\/my-site). Do not copy the following folders: js, components, data, locales, templates, and themes. Next give Respond permission to write to your site \/\/ make the directories writeable chown -R www-data app\/public\/sites chown -R www-data app\/resources\/sites 3. Login and Run the migration developer tool Login to your Respond site and run the migration development tool. Learn more Development tools. This does a lot of the heavy lifting for you. 4. Re-index your site Re-index your site using the Re-index pages developer tool. Learn more Development tools. 5. Add references to the R6 plugins JS and CSS Add references to the R6 plugins JS and CSS. \/\/ head of document &lt;link type=\"text\/css\" href=\"css\/plugins.css\" rel=\"stylesheet\"&gt; \/\/ end page &lt;script src=\"js\/plugins.js\"&gt;&lt;\/script&gt; 6. Update\/Add your menus, forms, galleries from the UI Plugins will not copy over from R6. So, I recommend simply re-creating these using the R6 UI.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/migrating",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "reCAPTCHA on Create",
        "description": "Learn how to setup Google reCAPTCHA on the create page in Respond.",
        "text": "reCAPTCHA on Create Learn how to use Google's reCAPTCHA to help prevent malicious site creations. 1. Enable reCAPTCHA Update the reCAPTCHA settings in .env to get started using reCAPTCHA in Respond. Google's reCAPTCHA tool requires you to sign up and generate a site and secret key for your site. You must specify your domain for the tool to work. Sign up for reCAPTCHA on the Google site: google.com\/recaptcha Variable Description RECAPTCHA_SITE_KEY The site key for reCAPTCHA. RECAPTCHA_SECRET_KEY The secret key for reCAPTCHA.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/recaptcha-on-create",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "reCAPTCHA on Forms",
        "description": "Learn how to setup Google reCAPTCHA on forms in Respond.",
        "text": "reCAPTCHA on Forms Learn how to use Google's reCAPTCHA to help prevent spam clicks on forms on your site. 1. Enable reCAPTCHA (for older Respond sites) For sites created using the default themes after the 6.04 update, you can skip this step. For older sites, you need to add the following settings to your site. This requires access to the code, so it can only be done by your application administrator. To update settings, open the file at resources\/sites\/site-name\/settings.json. Add the following settings and then validate the JSON file using JSON Lint. This adds the reCAPTCHA site key and secret key as settings for your site. { \"id\": \"reCAPTCHA-site-key\", \"label\": \"reCAPTCHA Site Key\", \"description\": \"The site key provided at google.com\/recaptcha\", \"type\": \"text\", \"value\": \"your-site-key\" }, { \"id\": \"reCAPTCHA-secret-key\", \"label\": \"reCAPTCHA Secret Key\", \"description\": \"The secret key provided at google.com\/recaptcha\", \"type\": \"text\", \"value\": \"your-secret-key\" }, Next, you have to navigate to the developer settings for your site by going adding the developer route (e.g. https:\/\/myapp.com\/developer) to the URL bar. Then click, \"Update Plugins\". This will grab the latest plugins from the theme. 2. Add your reCAPTCHA credentials. Navigate to settings and add your reCAPTCHA site key and secret key. You get these keys by signing up at Google's reCAPTCHA site. If you don't see these keys in settings, see step #1. 3. Enable reCAPTCHA To enable reCAPTCHA for a form, navigate to forms and click the overflow icon (three vertical dots) in the top right. Then, click \"Edit Form\". Then, simply change \"Validate with reCAPTCHA\" to \"Yes\" and click the \"Update\" button. When you refresh your page, you should see reCAPTCHA option.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/recaptcha-on-forms",
        "photo": "resources\/recaptcha-settings.png",
        "thumb": "resources\/recaptcha-settings.png",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Repositories",
        "description": "Learn about the repositories that house the Respond codebase",
        "text": "Repositories Learn about the repositories that house the Respond codebase. Respository Description madoublet\/respond The Respond repository contains the PHP (powered by Lumen) code for the application. This is the primary repo for the app. You can submit issues here for errors in the application. madoublet\/respond-ui The Respond UI repository contains the Angular 5 code for the application. madoublet\/respond-scripts This repository contains bash scripts that you can use to automate creating and updating your Respond installation. madoublet\/respond-website This repository contains the code that powers the respond website. You can submit PRs for new documentation or add an issue for needed documentation.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/repositories",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-07-16T03:40:10+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Server Requirements",
        "description": "Learn about the server requirements for Respond.",
        "text": "Recommended Server Requirements Respond is built on Lumen PHP, so it has the same requirements as Lumen. Server Requirements Linux (Ubuntu \/ Amazon AMI recommended) mod_rewrite enabled (Apache installations) Domain or sub-domain pointed at Respond directory (no sub-directory installations) PHP Requirements PHP >= 5.5.9 (PHP 7.2 recommended) OpenSSL PHP Extension PDO PHP Extension Mbstring PHP Extension ZIP PHP Extension CURL PHP Extension JSON PHP Extension GD Library PHP Extension",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/server-requirements",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Setting up Email",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Setting up Email Respond uses the PHPMailer project to send email within the system. So when a user signs up for a site, signs up for a subscription, or sends an email from a form on your site, it all goes through PHPMailer. Default Configuration By default, email is sent out via the default mail provider configured on your server. If you followed the Digital Ocean installation or use another VPS, you probably don't have one. Some shared servers offer this as an option. But, we think it is much better to outsource to a provider that specializes in this. Email from the app is always sent out to the primary email setup on the account. Custom Configuration To setup a custom email provider, Respond provides an SMTP configuration option. This is located in the .env file in the root. Variable Description EMAILS_FROM The from email address for emails sent by the app. EMAILS_FROM_NAME The from name for emails sent by the app. IS_SMTP Specifies whether the email is sent via SMTP. SMTP_HOST The SMTP Host for the server sending the emails SMTP_AUTH The SMTP Auth flag. SMTP_USERNAME The username to access the SMTP server. SMTP_PASSWORD The password to access the SMTP server. SMTP_SECURE The type of security used by the server. SMTPENC_KEY The penc key used by the server. Setting up Email Per Site You can configure Respond to send emails when forms are submitted by setting up the per site email settings. To do this, simply edit the settings.json file at resources\/sites\/my-site\/settings.json. [ ... { \"id\": \"EMAILS_FROM\", \"value\": \"matt@matthewsmith.com\" }, { \"id\": \"EMAILS_FROM_NAME\", \"value\": \"Matt @ Respond\" }, { \"id\": \"IS_SMTP\", \"value\": true }, { \"id\": \"SMTP_HOST\", \"value\": \"sample.host\" }, { \"id\": \"SMTP_PORT\", \"value\": 25 }, { \"id\": \"SMTP_AUTH\", \"value\": true }, { \"id\": \"SMTP_USERNAME\", \"value\": \"username\" }, { \"id\": \"SMTP_PASSWORD\", \"value\": \"password\" }, { \"id\": \"SMTP_SECURE\", \"value\": \"tls\" }, { \"id\": \"SMTPENC_KEY\", \"value\": \"iloverespond\" } ] Customizing Email Content You can easily customize the content in your emails by just editing an HTML file. The following emails are sent out from the Respond application: Email File Description Welcome Email resources\/emails\/new-user.html Sent out to the new user when a site is created. Reset Password resources\/emails\/reset-password.html Sent out when a user selects to reset a password.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/setting-up-email",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Creating themes",
        "description": "Learn how to create themes for Respond",
        "text": "Settings Theme settings enable you to allow global configurations across your site. They work great when you want to provide easy access for your users to change global design elements, such as logos, icons, or tile colors. A user can edit settings in the Settings UI of the Respond application. Creating a Setting Settings are stored on the theme under resources\/theme-name\/.private\/settings.json. They are copied to the site under resources\/sites\/site-name\/settings.json. Settings are stored in JSON in the following format. { \"id\": \"theme-logo\", \"label\": \"Logo\", \"description\": \"Primary logo of the site\", \"type\": \"image\", \"value\": \"files\\\/sample-logo.png\", \"sets\": \"attribute\", \"attribute\": \"src\" } Setting Description id The unique identifier for the setting. label The label shown in the settings UI. description The description shown in the settings UI. type The type of input shown in the settings UI (text or image are supported). value The default value of the setting. sets What is set by the setting (e.g. attribute) attribute The attribute that is set by the setting. Reference Settings in Code You reference a setting using the id of the setting as an attribute for the element. &lt;img theme-logo src=\"files\/persistence.png\"&gt;",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/settings",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Setup Reference",
        "description": "A quick reference on setting up Respond.",
        "text": "Setup Respond This documentation covers the setup options available for you to configure the&nbsp;Respond&nbsp;application. Configurations are specified in the \/.env file of the application Basic Settings Variable Description APP_ENV The environment mode (development or production) that the app is running in. APP_KEY The unique key for the app. APP_URL The url to access the app. By default this is set to autodetect. FRIENDLY_URLS Set to true or false. Specifies whether the system should use friendly URLs (urls without .html). This requires an .htaccess or similar mechanism set on the site to enable friendly URLs. DEFAULT_LANGUAGE The default language for the app. DEFAULT_DIRECTION The default direction for the app. White Label Settings Variable Description LOGO_URL The absolute URL to your logo in the Respond path PRIMARY_COLOR A hex value for the primary color of your app. PRIMARY_DARK_COLOR A hex value for the primary dark of your app. Email Settings Variable Description EMAILS_FROM The from email address for emails sent by the app. EMAILS_FROM_NAME The from name for emails sent by the app. IS_SMTP Specifies whether the email is sent via SMTP. SMTP_HOST The SMTP Host for the server sending the emails SMTP_AUTH The SMTP Auth flag. SMTP_USERNAME The username to access the SMTP server. SMTP_PASSWORD The password to access the SMTP server. SMTP_SECURE The type of security used by the server. SMTPENC_KEY The penc key used by the server. You can find more details on setting up email in the Setting up Email reference. App Settings Variable Description JWT_KEY The JavaScript Web Token key used to obfuscate tokens in Respond. PASSCODE The passcode used to create sites in the app. ALLOWED_FILETYPES Allowed filetypes that can be uploaded to your sites in Respond. THUMB_MAX_WIDTH The max width of thumbs created in Respond. THUMB_MAX_HEIGHT The max height of thumbs created in Respond. White Label Settings Coming in RC1 Variable Description LOGO_URL The logo to display on the login, reset password, and forgot password screens. PRIMARY_COLOR The hex color to use as the primary color for the application. This shows up in the side menu as well as in the editor. PRIMARY_DARK_COLOR The darker color that complements the primary color. This color is used in the context menu in the editor.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/setup-reference",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Solutions to Common Problems",
        "description": "Learn about how to solve common problems that come up with setting up and using Respond.",
        "text": "",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/solutions",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Translating the Respond Application",
        "description": "Learn how to translate Respond into another language.",
        "text": "",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/translations",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Updating Respond",
        "description": "Learn how to update Respond when a new version is released.",
        "text": "Updating Respond Updating Respond is easy. For ZIP installations, you simply replace the contents of your app directory. For Github installations, you need to pull the latest version and run gulp. Updating your ZIP installation To update your ZIP installation, you simply upload the contents of your zip file and replace the duplicates in your app\/. directory. You can do this from and sFTP client or use the command line as follows. Note that the code below assumes you followed the tutorial and are in the respond\/ directory. \/\/ navigate to your install directory cd \/path\/to\/respond\/ \/\/ get the zip file wget --content-disposition https:\/\/github.com\/madoublet\/respond\/blob\/master\/dist\/release.zip?raw=true \/\/ unzip it into the app directory (choose to rewrite all) unzip release.zip -d app Updating your Github installation To update your Github installation, you need to pull and run gulp. \/\/ navigate to your install directory cd \/path\/to\/respond\/app \/\/ pull the latest version git pull \/\/ update the latest npm npm update \/\/ run gulp to build the app gulp",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/updating-respond",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Webhooks",
        "description": "Learn how to enable Webhooks to extend the functionality of Respond",
        "text": "Webhooks Respond allows you to use Webhooks to get server callbacks when an event happens in Respond. Update the Webhooks settings in .env to get started using Webhooks in Respond. 1. Enable Webhooks Variable Description WEBHOOKS_URL The URL to callback when a webhook is called. If specified, a POST request will be sent to this URL when new sites are created, new users are created, and forms are submitted. The request will include JSON-encoded details on the created object.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/webhooks",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "White Label",
        "description": "Learn about how you can make Respond your own using our White Label options.",
        "text": "White Label Quickly add your own logo and styles to Respond to make it your own. Respond allows you to quickly white-label the application so that you can re-sell it or brand it as your own. Learn more below. Set Logo in .env Change the logo in the .env file by setting the LOGO_URL property. Variable Description LOGO_URL The absolute URL to your logo in the Respond path Customize CSS for the Application and Editor Respond allows you to override any CSS in the application and editor. To override any styles, navigate to resources\/white-label on your server. Make a copy of app.example.css and\/or editor.example.css. Remove the .example to activate the file. You can then add your custom styles to the document and they will pass to the app and editor.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/white-label",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:29+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Wildcard Subdomains",
        "description": "Learn how to setup wildcard subdomains for new sites created in Respond.",
        "text": "Wildcard Subdomain Installation The default installation method for&nbsp;Respond&nbsp;is AngularJS HTML5 mode. &nbsp;This works best for sites on a subdomain or root domain. &nbsp;This guide walks you through setting up&nbsp;wildcard subdomains so that you have your sites that you create automatically be mapped to a subdomain. 1. Enable vhost_alias module If you followed the Digital Ocean installation, you can do this via the following command. a2enmod vhost_alias service apache2 restart See this thread for additional options to enable this module:&nbsp;Invalid Command VirtualDocumentRoot 2. Set a subdomain to * This varies by DNS provider. &nbsp;But, typically you set the subdomain to * and URL Redirect it to a URL pointing at your server. &nbsp;If you use Namecheap, they provide a guide: &nbsp;How can I set up a catch-all (wildcard) subdomain? 3. Create a VirtualHost for your wildcard subdomains If you followed the&nbsp;Digital Ocean setup, you can create your VirtualHost using the following code. &nbsp;The exact virtualhost setup for our demo site is shown below. &lt;VirtualHost *:80> ServerName responddemo.website ServerAlias *.responddemo.website ServerAdmin matt@matthewsmith.com VirtualDocumentRoot \/var\/www\/html\/responddemo\/app\/sites\/%1\/ &lt;\/VirtualHost> # vim: syntax=apache ts=4 sw=4 sts=4 sr noet I use a standalone domain for this purpose. &nbsp;I have found that trying to use the same domain as your app (or other subdomains) causes issues.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/wildcard-subdomain-install",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Download",
        "description": "Download Respond to get started.",
        "text": "favorite Respond CMS is free and open source. Show some love on Patreon. Download Download our free, super powerful CMS today. Respond is free and open-source. Looking for a custom integration or installation services? Get in touch.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "download",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-29T20:06:37+0000",
        "template": "subscribe",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Bootstrap CMS",
        "description": "Respond is the original Bootstrap CMS.  Learn how we support Bootrap and build themes based on the framework.",
        "text": "Bootstrap CMS 100% Bootstrap Compliant code All the code generated by the CMS is 100% Bootstrap. So, if you are creating a new menu or form using our UI, the code generated matches the Bootstrap framework. Bootstrap Themes The default theme and all themes that are sold on the marketplace are built on Bootstrap as well. &nbsp;So, while most of the themes don't look like the default Bootstrap look and feel, you can be assured that they are just customized versions of the framework.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "feature\/bootstrap-cms",
        "photo": "resources\/tools.png",
        "thumb": "resources\/tools.png",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Feature: Working with Components",
        "description": "Learn how to create components for Respond",
        "text": "",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "feature\/components",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Creating a Site",
        "description": "Learn how to create one or more sites with Respond.",
        "text": "Create Multiple Sites Create one or more sites with Respond extensionComponent Whether you are creating one site or many, Respond makes it easy using our easy-to-use on-boarding screen. Simply select the theme, enter a site name, email and password and you are ready to go. You can restrict the creation of sites using the passcode built into your .env settings. Your browser does not support the video tag. Site administrators (learn more) can also quickly create sites from the Manage Sites page. Your browser does not support the video tag.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "feature\/create-site",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:29+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Feature: Editor Basics",
        "description": "Learn how to use the Respond editor.",
        "text": "Editor Basics Learn how to use the Beautiful, WYSIWYG editor in Respond to edit pagesextensionComponent Respond features a one-of-a-kind editor built to make adding and arranging content on your site a breeze. Simply click the \"Add Content\" button in the top right of the screen.&nbsp; Drag the element from the drawer onto your page.&nbsp; Then, just type your new content as if you are editing a document using a word processor. Your browser does not support the video tag. You can quickly style content using the contextual menu on the left of the screen. Just click on the text you want to edit and the contextual menu reflects the settings for your element. You can change the style of the text, the justification of the text, and even add links and shadows using the menu. Your browser does not support the video tag.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "feature\/editor-basics",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Feature: Editor",
        "description": "Learn how to create themes for Respond",
        "text": "Editor Respond features a one-of-a-kind editor that supports multi-column layouts, contextual semantic HTML elements, and drag-and-drop reordering of elements. We think it is the best CMS editor on the planet. Let us show you why. Multi-Column Layouts Respond allows you to create multi-column layouts within the editor. &nbsp;Create one, two, three, and four column layouts with ease using Bootstrap's (or similar framework) responsive grid. Contextual Menus Respond features powerful contextual menus that enable you to updated core properties of the widget. This makes it easier than ever to quickly adjust your content on the fly. And, much more... Respond's editor features many more features that you have come to expect in a great CMS: 25+ semantic elements and rich widgets Drag-and-Drop support Bold, italicize, strike, underline, link and modify your text with ease Full control of IDs and CSS classes Embed Google maps Pre-formatted (or code) text support Create lists of content, embed complete pages into your content, and even embed menus",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "feature\/editor",
        "photo": "resources\/columns.png",
        "thumb": "resources\/columns.png",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Feature: Working with Forms",
        "description": "Learn how to create forms in Respond.",
        "text": "Working with Forms Learn how to collect data using the form builder in Respond Forms enable you to quickly create forms and add form fields to your application. You can view form submissions directly from the Respond application. Your browser does not support the video tag. Respond automatically collects form submissions and displays them within your app. You can alternatively have them mailed to the site owner by setting up site email. Your browser does not support the video tag.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "feature\/forms",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Foundation CMS",
        "description": "Respond is the original Foundation CMS.  Learn how we support Foundation and build themes based on the framework.",
        "text": "Foundation CMS 100% Foundation Compliant code All the code generated by the CMS is 100% Foundation. So, if you are creating a new menu or form using our UI, the code generated matches the Foundation framework. Foundation Themes We provide a simple Foundation theme to help you get started building your own.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "feature\/foundation-cms",
        "photo": "resources\/tools.png",
        "thumb": "resources\/tools.png",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Feature: Working with Galleries",
        "description": "Learn how to create and modify galleries in Respond.",
        "text": "",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "feature\/gallery",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Feature: Working with the Menu",
        "description": "Learn how to work with menus in Respond.",
        "text": "",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "feature\/menu",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Learn how to use Respond",
        "description": "Learn how to get started with Respond.",
        "text": "Get Started Get started building your site with Respond. &nbsp;Respond&nbsp;is a 100% open source project. &nbsp;So, if you are a developer, you can setup a complete&nbsp;Respond&nbsp;install on your server.&nbsp;&nbsp;Not a developer? &nbsp;Contact us&nbsp;about hosting your site on Respond's server. &nbsp; Get started on our Learn page",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "get-started",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Help",
        "description": "Get Help with Respond!",
        "text": "favorite Respond CMS is free and open source. Show some love on Patreon. Get in Touch Get in touch. Email me at&nbsp;matt@matthewsmith.com&nbsp;or fill out the form below.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "help",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Respond - Build fast, responsive sites with Respond CMS",
        "description": "Build fast, responsive sites with Respond CMS.  Built for Bootstrap 4.",
        "text": "What's New in Respond Respond features a modern toolkit powered by Lumen PHP and Angular 5+. Responds makes building a responsive website easy with easy-to-build themes, a sane plugin system, and a beautiful UI that you will enjoy using everyday. The latest release allows you to quickly customize the colors and font of your theme with a beautiful theme configuration tool. Build your own Site Builder with Respond White Label Quickly customize the look-and-feel of Respond to make it your own. Learn more about our White Label CMS. Multiple Sites Effortlessly build and host multiple sites on a single server. Learn more about our Multi-site CMS. Recurring Payments Accept recurring credit card payments using Stripe Checkout. Beautiful Themes Respond comes with 5 starter themes that give you a great starting point for your site. All themes support major frameworks. So, you can quickly make Respond your Bootstrap CMS or Foundation CMS of choice. You can download more ready-to-go for free from our marketplace. Powered by a Modern Technology Stack Lumen PHP Lumen is an elegant, well-documented, and easy-to-use backend framework that enables you to quickly extend Respond to meet the needs of your application. Angular 5 Angular 5 is the fast, component-based framework built by Google that enables you to quickly add new experiences to your Respond-powered application. Bootstrap 4 By pairing the brand new Bootstrap 4 with static sites, Respond makes backups easy and allows you to save money by enabling deployment to static hosting services. Easy-to-Use Visual Editor Respond features a beautiful, easy-to-use visual editor that allows you to edit content right on the page. Quickly modify text style, color, shadows and more using our brilliant contextual editor. Built Simple Simple Plugins With Respond 6, Respond plugins are as simple as writing a small line of HTML to specify what is output to the screen. More advanced plugins can easily be made using a bit of JavaScript. Sites as Themes Tired of learning a new framework just to create a theme? With Respond 6, your site is your theme. Just add a few attributes and a configuration file and you are ready to go. Flat File Our flat-file approach makes it easy to move, backup and restore sites. And, not having a database makes it easier then ever before to setup and secure Respond. Perfect for designers, developers and entrepreneurs Respond has completely rethought the CMS experience to make it easy for you to compete with the big-box website creation tools. We provide you everything you need to build and scale your sites while providing you with the flexibility to create beautiful experiences for your customers. On top of that we provide a one-of-a-kind editing experience that we think your clients will love. Get started today",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "index",
        "photo": "resources\/white-label.png",
        "thumb": "resources\/white-label.png",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-29T19:47:55+0000",
        "template": "home",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Documentation",
        "description": "Check out our documentation to learn how to use Respond.",
        "text": "favorite Respond CMS is free and open source. Show some love on Patreon. Learn Learn how to install, configure and extend Respond. Building your Site with Respond Tutorial Description Creating One or More Sites See how you can quickly create multiple sites with Respond. Using the Editor See how you can quickly use our one-of-a-kind editor to edit and arrange content. Changing Background Images Learn how to quickly change background images to customize Respond themes. Working with Components See how you can use components to re-use content across pages in your site. Working with Menus See how you can use the menus UI to change menus throughout your site. Working with Gallery Images The gallery enables you to quickly create groups of images and arrange them into slideshows or galleries. Working with Forms Forms enable you to quickly create forms and add form fields to your application. Editing Templates Learn how to change the header and footer of your site using templates. Changing the Logo Learn how to change the logo of your site using templates. Editing Page HTML Learn how to edit the HTML of your pages. Setting up a Stripe Subscription Learn how to setup a subscription in Stripe. Configuring Respond Tutorial Description Setup Reference A reference to configuration options available .env. Setting up Email Learn how to setup and customize emails in Respond. Translating Respond A reference on translating the app using simple JSON files. Setting up Friendly URLs Learn how to enable friendly URLs. White Label Respond Adjust the logo and colors of Respond to make it your own. Enabling Google Maps Learn how to enable Google maps in Respond. Enabling Facebook Open Graph Learn how to enable Facebook Open Graph in Respond. reCAPTCHA on Site Creation Learn how to enable reCAPTCHA on site creation. reCAPTCHA on Forms Learn how to enable reCAPTCHA on forms within your site. Creating a Site Administrator Learn how to create a site administrator in Respond. Customizing Themes, Plugins and Settings Tutorial Description Creating Themes A reference for creating Themes with Respond. Creating Plugins A reference for creating Plugins with Respond. Theme Settings A reference for creating settings with Respond. Installing and Updating Respond Tutorial Description Installation Learn how to install Respond on your own server from the ZIP download (recommended for production) CPANEL Installation Learn how to install Respond on a server powered by CPANEL. Local Installation on your Mac or PC Learn how to install Respond on your own local machine on your Mac or PC using Vagrant and VirtualBox Digital Ocean Installation Step-by-Step instructions to install Respond on Digital Ocean. Development Installation Learn how to install Respond on your own server using Git.(recommended for development) Wildcard Subdomain Installation Learn how to setup wildcard subdomains to host multiple sites on Respond. Server Requirements Learn more about the server requirements for Respond 4. Updating Respond Learn how to update Respond when a new version is released. Setting up Amazon S3 Sync Learn how to sync your site with Amazon S3. Development Tutorial Description Developer Tools Learn about the developer tools available for sites created in Respond Repositories Learn about the repositories that house the Respond codebase. Build Options Learn about build options available to Respond developers. Gulp Recipes Learn about we use Gulp to package our themes and sites for deployment. Troubleshooting Tutorial Description Solutions to Common Problems This guide walks you through solutions to common problems encountered when setting up Respond.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "learn",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Marketplace",
        "description": "Purchase and download free themes in the Respond marketplace.",
        "text": "Marketplace A new Respond store launching in early March.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "marketplace",
        "photo": "resources\/aspire.png",
        "thumb": "resources\/aspire.png",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "About",
        "description": "Learn more about Respond.",
        "text": "favorite Respond CMS is free and open source. Show some love on Patreon. About Respond is more than just another CMS, it is our craft and passion. At Respond, we believe that websites are best created by individual creators, not by large website builders looking to push a one size fits all template for $9.99 per month.&nbsp; But, we acknowledge the convenience and the empowerment of these DIY site builders.&nbsp; So, we created Respond to empower individual creators, entrepreneurs, and agencies to deliver better websites by given them a one-of-a-kind tool that combines the simplicity of site builder with the elegance of a hand coded site.We feel that Respond is a best-in-class tool that dramatically improves the website production experience for both the creator and the end user.&nbsp;&nbsp;Try our demo.&nbsp; If you feel the same way, we would love to have you&nbsp;join us. Respond&nbsp;is designed and built by&nbsp;Matthew Smith.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "page\/about",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Acknowledgments",
        "description": "Learn about all the other open source products that are used to make Respond a great product.",
        "text": "Acknowledgements This is just a quick shout out to all the great open source projects that are used to make Respond great. Font Awesome&nbsp;- A lot of the icons used within the editor come from Font Awesome. &nbsp;This project continues to make the lives of developers easier. Magnific Popup&nbsp;- Magnific powers the lightbox feature of Respond. AngularJS&nbsp;- The fantastic front-end framework that powers the app and sites in Respond. Bootstrap&nbsp;- Powers the layout and style of the apps and sites. Unsplash&nbsp;- The ultra cool resource for beautiful, free stock photos. &nbsp;They make our themes look great. LessPHP&nbsp;- The library that powers our LESS to CSS conversions. TonicPHP&nbsp;- The framework that powers our REST API. Guzzle&nbsp;- Guzzle provides the backend for our Amazon implementation, as well as, the framework for our webhooks implementation. PHPMailer&nbsp;- Provides the underlying framework for emails sent in the system. Composer&nbsp;- Handles dependency management within the application. Firebase PHP-JWT&nbsp;- Provides our web token authentication implementation. jQuery&nbsp;- Used to simplify some of our scripting. i18next&nbsp;- Used for internationalizing the app and the sites. ng-i18next&nbsp;- Integrates the i18next JS framework with AngularJS CodeMirror&nbsp;- Used for editing HTML and CSS within the application. MomentJS&nbsp;- Handles time within the application A big thank you to all those who build these great projects.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "page\/acknowledgements",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Contact",
        "description": "Get in touch using our contact form.",
        "text": "",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "page\/contact",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Documentation",
        "description": "Read our documentation to learn how to use Respond.",
        "text": "Learn Our documentation walks you through installing, configuring and extending Respond. Installing and Updating Respond Tutorial Description Installation Learn how to install&nbsp;Respond&nbsp;on your own server. Digital Ocean Installation Step-by-Step instructions to install Respond on Digital Ocean. Wildcard Subdomain Installation&nbsp; Learn how to setup wildcard subdomains to host multiple sites on Respond. Server Requirements Learn more about the server requirements for Respond 4. Install from ZIP Learn how to install Respond using a ZIP file. Updating Respond Learn how to update Respond when a new version is released. Key Concepts Tutorial Description Themes A reference for creating Themes with&nbsp;Respond. Plugins A reference for creating Plugins with Respond. Configuring and Using Respond Tutorial Description Setup Reference A reference to configuration options available .env. Managing Multiple Sites Learn how to manage multiple sites in Respond. Setting up Email Learn how to setup and customize emails in Respond. Translating Respond A reference on translating the app using simple JSON files. Troubleshooting Tutorial Description Solutions to Common Problems This guide walks you through solutions to common problems encountered when setting up&nbsp;Respond.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "page\/documentation",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Error",
        "description": "Error'd.  Something went wrong.",
        "text": "Page Not Found We were unable to find the page you requested.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "page\/error",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "License",
        "description": "Learn about how we license Respond.",
        "text": "",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "page\/license",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Privacy Policy",
        "description": "Read our privacy policy.",
        "text": "Privacy Policy Your privacy is important to us. Here are a few of our core principles: We don't ask for information unless we need it We don't require any information to create a site, you enter as much or as little as you are comfortable with We only store what you enter on the server We use strong cryptography to store your password and do not store identifiable information in cookies\/session We use Stripe to process Credit Cards. We do not store your Credit Card Information. Website Visitors Like most website operators, Respond collects non-personally-identifying information of the sort that web browsers and servers typically make available, such as the browser type, language preference, referring site, and the date and time of each visitor request. Responds purpose in collecting non-personally identifying information is to better understand how Responds visitors use its website. From time to time, Respond may release non-personally-identifying information in the aggregate, e.g., by publishing a report on trends in the usage of its website. Respond also collects potentially personally-identifying information like Internet Protocol (IP) addresses for logged in users. Respond only discloses logged in user addresses under the same circumstances that it uses and discloses personally-identifying information as described below. Gathering of Personally-Identifying Information Certain visitors to Responds websites choose to interact with Respond in ways that require Respond to gather personally-identifying information. The amount and type of information that Respond gathers depends on the nature of the interaction. For example, Respond users who sign up for our service enter their email, name, password, and property information. We only require email, name, password, and address to create an account. All other information is supplied at the discretion of the user. Respond does not disclose personally-identifying information other than as described below. And visitors can always refuse to supply personally-identifying information, with the caveat that it may prevent them from engaging in certain website-related activities. Aggregated Statistics Respond may collect statistics about the behavior of visitors to its websites. For instance, Respond may monitor listings on the site. Respond may display this information publicly or provide it to others. However, Respond does not disclose personally-identifying information other than as described below. Protection of Certain Personally-Identifying Information Respond discloses potentially personally-identifying and personally-identifying information only to those of its employees, contractors and affiliated organizations that (i) need to know that information in order to process it on Responds behalf or to provide services available at Responds websites, and (ii) that have agreed not to disclose it to others. Some of those employees, contractors and affiliated organizations may be located outside of your home country; by using Responds websites, you consent to the transfer of such information to them. Respond will not rent or sell potentially personally-identifying and personally-identifying information to anyone. Other than to its employees, contractors and affiliated organizations, as described above, Respond discloses potentially personally-identifying and personally-identifying information only in response to a subpoena, court order or other governmental request, or when Respond believes in good faith that disclosure is reasonably necessary to protect the property or rights of Respond, third parties or the public at large. If you are a registered user of an Respond website and have supplied your email address, Respond may occasionally send you an email to tell you about new features, solicit your feedback, or just keep you up to date with whats going on with Respond and our products. We primarily use our various product blogs to communicate this type of information, so we expect to keep this type of email to a minimum. If you send us a request (for example via a support email or via one of our feedback mechanisms), we reserve the right to publish it in order to help us clarify or respond to your request or to help us support other users. Respond takes all measures reasonably necessary to protect against the unauthorized access, use, alteration or destruction of potentially personally-identifying and personally-identifying information. Sessions A session is a string of information that a website stores on a visitors computer, and that the visitors browser provides to the website each time the visitor returns. Respond uses sessions to help Respond identify and track visitors, their usage of Respond website, and their website access preferences. Respond visitors who do not wish to have sessions placed on their computers should set their browsers to refuse sessions before using Responds websites, with the drawback that certain features of Responds websites may not function properly without the aid of cookies. Business Transfers If Respond, or substantially all of its assets, were acquired, or in the unlikely event that Respond goes out of business or enters bankruptcy, user information would be one of the assets that is transferred or acquired by a third party. You acknowledge that such transfers may occur, and that any acquirer of Respond may continue to use your personal information as set forth in this policy. Ads Ads appearing on any of our websites may be delivered to users by advertising partners, who may set cookies. These cookies allow the ad server to recognize your computer each time they send you an online advertisement to compile information about you or others who use your computer. This information allows ad networks to, among other things, deliver targeted advertisements that they believe will be of most interest to you. This Privacy Policy covers the use of cookies by Respond and does not cover the use of cookies by any advertisers. Privacy Policy Changes Although most changes are likely to be minor, Respond may change its Privacy Policy from time to time, and in Responds sole discretion. Respond encourages visitors to frequently check this page for any changes to its Privacy Policy. Your continued use of this site after any change in this Privacy Policy will constitute your acceptance of such change.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "page\/privacy-policy",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Technology",
        "description": "Learn about the technology behind Respond.",
        "text": "Respond Technology Respond is powered by Angular 2 and the Lumen PHP framework. Sites produced by the CMS are static HTML.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "page\/technology",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Terms of Service",
        "description": "Learn about our terms of service.",
        "text": "Terms of Service The following terms and conditions govern all use of the Respond website and all content, services and products available at or through the website. The Website is owned and operated by Matthew Smith, LLC. The Website is offered subject to your acceptance without modification of all of the terms and conditions contained herein and all other operating rules, policies (including, without limitation, Respond's Privacy Policy) and procedures that may be published from time to time on this Site by Respond (collectively, the Agreement). Please read this Agreement carefully before accessing or using the Website. By accessing or using any part of the web site, you agree to become bound by the terms and conditions of this agreement. If you do not agree to all the terms and conditions of this agreement, then you may not access the Website or use any services. If these terms and conditions are considered an offer by Respond, acceptance is expressly limited to these terms. The Website is available only to individuals who are at least 13 years old. Your Respond Site and Account If you operate a Respond application, you are responsible for maintaining the security of your site, and you are fully responsible for all activities that occur under the account and any other actions taken in connection with the site. Respond will not be liable for any acts or omissions by You, including any damages of any kind incurred as a result of such acts or omissions. Responsibility of Contributors If you operate a Respond application, you are entirely responsible for the content of, and any harm resulting from, that Content. That is the case regardless of whether the Content in question constitutes text, graphics, an audio file, or computer software. By making Content available, you represent and warrant that: the downloading, copying and use of the Content will not infringe the proprietary rights, including but not limited to the copyright, patent, trademark or trade secret rights, of any third party; if your employer has rights to intellectual property you create, you have either (i) received permission from your employer to post or make available the Content, including but not limited to any software, or (ii) secured from your employer a waiver as to all rights in or to the Content; you have fully complied with any third-party licenses relating to the Content, and have done all things necessary to successfully pass through to end users any required terms; the Content does not contain or install any viruses, worms, malware, Trojan horses or other harmful or destructive content; the Content is not spam, is not machine- or randomly-generated, and does not contain unethical or unwanted commercial content designed to drive traffic to third party sites or boost the search engine rankings of third party sites, or to further unlawful acts (such as phishing) or mislead recipients as to the source of the material (such as spoofing); the Content is not pornographic, does not contain threats or incite violence, and does not violate the privacy or publicity rights of any third party; your site is not getting advertised via unwanted electronic messages such as spam links on newsgroups, email lists, other blogs and web sites, and similar unsolicited promotional methods; your site is not named in a manner that misleads your readers into thinking that you are another person or company. For example, your blogs URL or name is not the name of a person other than yourself or company other than your own; and you have, in the case of Content that includes computer code, accurately categorized and\/or described the type, nature, uses and effects of the materials, whether requested to do so by Respond or otherwise. By submitting Content to Respond for inclusion on your Website, you grant Respond a world-wide, royalty-free, and non-exclusive license to reproduce, modify, adapt and publish the Content solely for the purpose of displaying, distributing and promoting your blog. If you delete Content, Respond will use reasonable efforts to remove it from the Website, but you acknowledge that caching or references to the Content may not be made immediately unavailable. Without limiting any of those representations or warranties, Respond has the right (though not the obligation) to, in Respond sole discretion (i) refuse or remove any content that, in Respond's reasonable opinion, violates any Respond policy or is in any way harmful or objectionable, or (ii) terminate or deny access to and use of the Website to any individual or entity for any reason, in Respond sole discretion. Respond will have no obligation to provide a refund of any amounts previously paid. Payment and Renewal Respond is a paid service. By downloading and installing the application, you agree to pay Respond the fees indicated for that service. Payments will be charged on a pre-pay basis on the day you sign up and will cover the use of that service for the period as indicated. Fees are not refundable. Automatic Renewal Unless you notify Respond before the end of the applicable subscription period that you want to cancel your subscription, your subscription will automatically renew and you authorize us to collect the then-applicable annual or monthly subscription fee (as well as any taxes) using any credit card or other payment mechanism we have on record for you. Subscriptions can be canceled at any time in the Account section of your dashboard. Responsibility of Website Visitors Respond has not reviewed, and cannot review, all of the material, including computer software, posted to the Website, and cannot therefore be responsible for that materials content, use or effects. By operating the Website, Respond does not represent or imply that it endorses the material there posted, or that it believes such material to be accurate, useful or non-harmful. You are responsible for taking precautions as necessary to protect yourself and your computer systems from viruses, worms, Trojan horses, and other harmful or destructive content. The Website may contain content that is offensive, indecent, or otherwise objectionable, as well as content containing technical inaccuracies, typographical mistakes, and other errors. The Website may also contain material that violates the privacy or publicity rights, or infringes the intellectual property and other proprietary rights, of third parties, or the downloading, copying or use of which is subject to additional terms and conditions, stated or unstated. Respond disclaims any responsibility for any harm resulting from the use by visitors of the Website, or from any downloading by those visitors of content there posted.Content Posted on Other Websites. We have not reviewed, and cannot review, all of the material, including computer software, made available through the websites and webpages to which Respond links, and that link to Respond. Respond does not have any control over those non-Respond websites and webpages, and is not responsible for their contents or their use. By linking to a non-Respond website or webpage, Respond does not represent or imply that it endorses such website or webpage. You are responsible for taking precautions as necessary to protect yourself and your computer systems from viruses, worms, Trojan horses, and other harmful or destructive content. Respond disclaims any responsibility for any harm resulting from your use of non-Respond websites and webpages. Copyright Infringement and DMCA Policy Respond asks others to respect its intellectual property rights, it respects the intellectual property rights of others. If you believe that material located on or linked to by Respond.com violates your copyright, you are encouraged to notify Respond in accordance with Responds Digital Millennium Copyright Act (DMCA) Policy. Respond will respond to all such notices. Respond will terminate a visitors access to and use of the Website if, under appropriate circumstances, the visitor is determined to be a repeat infringer of the copyrights or other intellectual property rights of Respond or others. In the case of such termination, Respond will have no obligation to provide a refund of any amounts previously paid to Respond.Intellectual Property. This Agreement does not transfer from Respond to you any Respond or third party intellectual property, and all right, title and interest in and to such property will remain (as between the parties) solely with Respond. Respond, Respond, respondcms.com, the respondcms.com logo, and all other trademarks, service marks, graphics and logos used in connection with Respond.io, or the Website are trademarks or registered trademarks of Respond or Respond licensors. Other trademarks, service marks, graphics and logos used in connection with the Website may be the trademarks of other third parties. Your use of the Website grants you no right or license to reproduce or otherwise use any Respond or third-party trademarks. Termination Respond may terminate your access to future updates of Respond, with or without cause, with or without notice, effective immediately. If you wish to terminate this Agreement or your Respond CMS account (if you have one), you may simply email us or contact us using the form on the site. All provisions of this Agreement which by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, indemnity and limitations of liability. Disclaimer of Warranties The Website is provided as is. Respond and its suppliers and licensors hereby disclaim all warranties of any kind, express or implied, including, without limitation, the warranties of merchantability, fitness for a particular purpose and non-infringement. Neither Respond nor its suppliers and licensors, makes any warranty that the Website will be error free or that access thereto will be continuous or uninterrupted. If youre actually reading this, heres a treat. You understand that you download from, or otherwise obtain content or services through, the Website at your own discretion and risk.Limitation of Liability. In no event will Respond, or its suppliers or licensors, be liable with respect to any subject matter of this agreement under any contract, negligence, strict liability or other legal or equitable theory for: (i) any special, incidental or consequential damages; (ii) the cost of procurement for substitute products or services; (iii) for interruption of use or loss or corruption of data; or (iv) for any amounts that exceed the fees paid by you to Respond under this agreement during the twelve (12) month period prior to the cause of action. Respond shall have no liability for any failure or delay due to matters beyond their reasonable control. The foregoing shall not apply to the extent prohibited by applicable law. General Restrictions and Warranties You represent and warrant that (i) your use of the Website will be in strict accordance with the Respond Privacy Policy, with this Agreement and with all applicable laws and regulations (including without limitation any local laws or regulations in your country, state, city, or other governmental area, regarding online conduct and acceptable content, and including all applicable laws regarding the transmission of technical data exported from the United States or the country in which you reside) and (ii) your use of the Website will not infringe or misappropriate the intellectual property rights of any third party. Indemnification You agree to indemnify and hold harmless Respond, its contractors, and its licensors, and their respective directors, officers, employees and agents from and against any and all claims and expenses, including attorneys fees, arising out of your use of the Website, including but not limited to your violation of this Agreement. Miscellaneous This Agreement constitutes the entire agreement between Respond and you concerning the subject matter hereof, and they may only be modified by a written amendment signed by an authorized executive of Respond, or by the posting by Respond of a revised version. Except to the extent applicable law, if any, provides otherwise, this Agreement, any access to or use of the Website will be governed by the laws of the state of Missouri, U.S.A., excluding its conflict of law provisions, and the proper venue for any disputes arising out of or relating to any of the same will be the state and federal courts located in St. Louis County, Missouri. Except for claims for injunctive or equitable relief or claims regarding intellectual property rights (which may be brought in any competent court without the posting of a bond), any dispute arising under this Agreement shall be finally settled in accordance with the Comprehensive Arbitration Rules of the Judicial Arbitration and Mediation Service, Inc. (JAMS) by three arbitrators appointed in accordance with such Rules. The arbitration shall take place in St. Louis, Missouri, in the English language and the arbitral decision may be enforced in any court. The prevailing party in any action or proceeding to enforce this Agreement shall be entitled to costs and attorneys fees. If any part of this Agreement is held invalid or unenforceable, that part will be construed to reflect the parties original intent, and the remaining portions will remain in full force and effect. A waiver by either party of any term or condition of this Agreement or any breach thereof, in any one instance, will not waive such term or condition or any subsequent breach thereof. You may assign your rights under this Agreement to any party that consents to, and agrees to be bound by, its terms and conditions; Respond may assign its rights under this Agreement without condition. This Agreement will be binding upon and will inure to the benefit of the parties, their successors and permitted assigns.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "page\/terms-of-service",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Themes",
        "description": "View the beautiful themes available for Respond.",
        "text": "Themes Respond themes updated for R6.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "page\/themes",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Tour",
        "description": "Take a tour of all the features that make Respond great.",
        "text": "favorite Respond CMS is free and open source. Show some love on Patreon. Tour See why Respond is the best way to create modern, responsive websites. A Beautiful UI Respond features a beautiful, app inspired UI that puts the focus where it should be - on your content. Images are pulled forward from the page to ease discovery and draw you into the app. A Superior Editing Experience Respond features a one-of-a-kind visual editor that allows you to edit elements on the page as they appear on your site. You can drag-and-drop new and existing elements, sort blocks, and change CSS classes with ease. Learn more about our editor. Powerful Tools Respond provides you all the tools you need to build your website. Update menus, galleries, forms, and files from an easy-to-use interface without having to navigate through your site. Create and Manage Multiple Sites Respond allows you to create and manage multiple sites. Easily create new sites with a few clicks using our built-in site creation tool. And, because all our sites our deployed via static HTML, you can easily host multiple sites on your server without high monthly premiums.Learn how you can&nbsp;manage multiple sites using Respond.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "page\/tour",
        "photo": "resources\/screen.png",
        "thumb": "resources\/screen.png",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:29+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Respond 6 Beta",
        "description": "Learn more about what is coming as part of the Respond 6 beta",
        "text": "Respond 6 Respond has always been about taking the best of modern development technologies and applying them to the CMS space. We were among the first to embrace responsive design, the Bootstrap front-end framework, SPA-powered apps, and web components. We did this not to be first, but rather to provide a better user experience to our end users and developers. So, when we set out to develop Respond 6, we looked for innovative ways to continue to improve Respond. We focused on three key areas: modernizing our technology stack, improving our overall user experience, and building a best-in-class developer experience. Modern Technology Stack Respond 6 is powered by a modern technology stack. On the backend, we stuck with PHP because of its stability, ubiquity, and overall cost effectiveness. But, we moved from a custom PHP stack to the Lumen framework from the team at Laravel. Lumen is a well-documented, light-weight framework that works great for REST APIs. In addition, we completely removed database dependencies from the CMS. So, the CMS is completely powered by the content of the sites and JSON setup files. For the app, we chose the component-based Angular 2 framework. Angular 2 gives us a beautiful code-base that can easily be extended. The new visual editor is powered by Hashedit. Hashedit is a beautiful, visual editor created by the Respond team. But, it is now decoupled from the CMS. Finally, we re-engineered sites created by the CMS to be completely static. There are now no dependencies on the app itself. So, you can run them on the same server as Respond or even deploy them to static based hosting service (like Amazon S3) to lower your hosting costs. The combination of Lumen, Angular 2, Hashedit, and static HTML gives Respond a power stack to develop your sites. Improved User Experience A hallmark of the Respond experience has always been a great user experience. For Respond 6, we improved the UX of the app by completely redesigning the editing experience to be a completely visual experience. For the end user, this means you are editing the site as it appears in the browser. This aligns the editing experience with the user's mental model and greatly reduces the need for training. We have also pulled forward common use cases such as forms, galleries, and menus so that they can easily be editing without having to drill down to the pages in the app. Finally, we have made the whole experience lightning fast and completely mobile so that Respond users an edit pages quickly from anywhere. Improved Developer Experience A key aspect of a CMS that is often ignored, is the developer experience when building sites, themes, and plugins. For Respond 6, we made this a priority during development. We asked ourselves: if it is so easy to create a site from scratch, why is it so difficult to develop a theme or plugin. Just look at the mess of documentation required to create a theme or plugin for the most popular content management systems. Respond 6 is different. We focused on making it really easy to build themes and plugins. We developed two key technologies to do so. We call the first one \"sites as themes\". And, it as simple as it sounds. To build a theme for Respond 6, you simply build a site and follow some really easy-to-follow best practices. Our themes actually can run in a browser. The second is a plugin system that enables you to build plugins with a little JSON and an HTML snippet. Respond 6 has by far the simplest themes and a plugins of any other CMS. Period. We think this will create a CMS that you love to develop with. I think the combination of a great technology stack, an improved UI, and a best-in-class developer experience will make Respond 6 a system that you (and your customers) will love to use.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "post\/respond-6",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Services",
        "description": "Learn about the services we provide to help you with Respond.",
        "text": "",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "services",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Support",
        "description": "Read about our support options.",
        "text": "Support Reach out at matt@matthewsmith.com or fill out the form below.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "support",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Learn how to use Respond",
        "description": "Check out videos of Respond.",
        "text": "Videos The videos will walk you through using Respond on a day-to-day basis to create sites, update content, and change the look-and-feel of your sites. Creating a site with Respond This video walks you through creating a site with Respond CMS. &nbsp;Creating a site is as easy as adding your site name, typing in an email and password, and selecting a theme. &nbsp;In under a minute, you will have a beautiful responsive website. Updating and creating content using the Respond editor This video will walk you through updating and creating content using the Respond CMS editor. &nbsp;Updating content is as easy as clicking and typing the new content in the application. &nbsp;You can add content by dragging and dropping widgets from the top menu bar. Configuring your theme This video will walk you through configuring the look-and-feel of your site using the new theme configuration tool in Respond. Changing your theme This video will walk you through changing your theme using Respond CMS. &nbsp;By changing your theme you can alter the entire look-and-feel of your site. &nbsp;This video also showcases some great themes available in our&nbsp;marketplace. 100% open source, always. Built by Matthew Smith in Manchester, MO. Respond 6 is an open source, responsive content management system built on the Lumen PHP and Angular 2 frameworks. Respond 6 is built so that you can quickly build beautiful, responsive websites. The latest version features flat-file storage, a beautiful visual editor, and fast static sites. Home Tour Learn Store Help Partners",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "videos",
        "photo": "",
        "thumb": "",
        "location": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Releases",
        "description": "Documents what has changed in each release and what you need to do to upgrade.",
        "text": "",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "page\/releases",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "location": "",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Respond UI",
        "description": "Setup front-end development for Respond using the Angular CLI.",
        "text": "",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/setup-respond-ui",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "location": "",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Test Form",
        "description": "This is a test form",
        "text": "",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "test",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "location": "",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Install with CPANEL",
        "description": "Learn how to install Respond using CPANEL.",
        "text": "",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/cpanel-installation",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "location": "",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Multi-Site CMS",
        "description": "Manage multiple sites with ease using Respond CMS.",
        "text": "Multi-Site CMS Manage multiple sites with ease with Respond CMS. Respond allows you to manage multiple sites with ease using our powerful sites console.&nbsp; From the console, you can switch sites, create sites, and set system-level messages.&nbsp; From the console, you can manage a subset of sites in the system or manage all sites in the system using the system administrator role.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "feature\/multi-site-cms",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:31+0000",
        "template": "default",
        "location": "",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "White Label CMS",
        "description": "Make Respond your own with our white label CMS.",
        "text": "White Label CMS Make Respond your own with our white label CMS. Respond makes it easy to quickly apply your brand to Respond.&nbsp; A Respond license gives you the freedom to market the system under your own brand.&nbsp; From logos to colors, the whole system can be customized to match your brand and appeal to your market.&nbsp;&nbsp;",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "feature\/white-label-cms",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "location": "",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Thank You",
        "description": "Thank you for subscribing to Respond!",
        "text": "Thank You Thank you for subscribing to Respond!&nbsp; We are excited to help you start building your business with Respond.&nbsp; You should receive an email with your receipt.&nbsp; We will be in touch within a few hours to start the process of getting Respond setup for you.&nbsp; If you have any questions in the meantime, feel free to reach out via our&nbsp;contact form&nbsp;or contact me directly at&nbsp;matt@matthewsmith.com.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "page\/thank-you",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "location": "",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Setting up Amazon S3 Sync",
        "description": "Learn how to connect Respond to your Amazon S3 bucket.",
        "text": "Setting up Amazon S3 Sync Connect your site to Amazon S3 to improve site scale and performance Respond makes it easy to connect your site to an Amazon S3 bucket.&nbsp; This allows you to sync your entire site to Amazon S3 or simply store your files on Amazon to save storage space on your server. Amazon S3 Sync Settings You can find the Amazon Sync settings in Settings &gt; Amazon Sync Settings tab. These settings are all that is needed to connect your site to Amazon S3. An explanation for each setting is given below. Setting Description S3 Access Key The S3 access key obtained from Amazon Identity and Access Management (IAM). S3 Secret Key The S3 access key obtained from Amazon IAM. S3 Bucket The name of your bucket. S3 Region The region code where your bucket is located. See Amazon Bucket Region codes. Upload files directly to S3 If set to true, files will NOT be stored on your server. Rather, they will be directly uploaded to S3. S3 Url The base URL of the bucket. This URL will be used in the app and your website to reference the files and images uploaded directly to S3. Sync Site to Amazon S3Once settings are updated, you can sync your site with Amazon S3 by going to Advanced &gt; Sync Site and select Execute.Hosting your static respond site using amazon cloudfront, route 53, and s3Once you can sync your site to S3 in Respond, you can host your entire site with SSL using the Amazon cloud.&nbsp; You can find a great walkthrough by Will Morgan on Medium here:&nbsp;https:\/\/medium.com\/@willmorgan\/moving-a-static-website-to-aws-s3-cloudfront-with-https-1fdd95563106",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/setting-up-amazon-s3-sync",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "location": "",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Editing Page HTML",
        "description": "Learn how to change the page HTML.",
        "text": "Editing Page HTML Get greater control of your content by editing the page's HTML. Editing the page HTML can give you greater control over the content in your page.&nbsp; This is easy to do in Respond.&nbsp; Simply select the \"Edit HTML\" option from the pages menu.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/editing-page-html",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "location": "",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Changing the Logo",
        "description": "Quickly change the logo from settings",
        "text": "Changing the Logo Quickly change the logo from settings You can quickly change the logo for your site using the site's settings.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/changing-the-logo",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "location": "",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Editing Templates",
        "description": "Edit templates to change the header and footer of your pages.",
        "text": "Editing Templates Edit templates to change the header and footer of your pages. In Resond, every page inherits from a template. The template controls what is outside of your content. Changing templates enables you to make cross-site changes to your header, footer, and meta data that controls your pages.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/editing-templates",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "location": "",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Setting up a Stripe Subscription",
        "description": "Learn how to setup a Stripe subscription using products in Respond.",
        "text": "Setting up a Stripe Subscription Learn how to setup a Stripe subscription using products in Respond. extensionComponent This documentation walks you through creating a subscription plan in Stripe and tying that plan to a product in Respond. 1. Create a product and plan in StripeStart by creating a product in Stripe.&nbsp; Navigate to Billing &gt; Products.&nbsp; Products are used to manage Stripe subscriptions. Important: Products and Plans are unique to the environment (test or production) in Stripe.&nbsp; So, you must create a product\/plan in both environments.Next, create a plan.&nbsp; The Stripe UI should automatically switch to adding a plan after creating a product.&nbsp; Note the Plan ID.&nbsp; You will use this later in Respond.2. Get the API Keys for StripeNavigate to Developers &gt; API Keys.&nbsp; Copy both the Publishable key and Secret key.3. Setup the cart in respondIn Respond, the cart is the center of e-commerce activity.&nbsp; Navigate to Settings &gt; Shopping Cart.Set the Publishable key and Secret key in Respond.&nbsp; Click Save.&nbsp; Quick note: Respond encrypts the secret key so it will display as ***** after you hit save.4. Create a productNavigate to Products and select \"Add Product\".&nbsp; Choose a name and description.&nbsp; You can also to automatically generate a page for the product.&nbsp; This is a good practice to do while you are learning to use products.Choose yes from the \"Is the product a subscription?\" menu and add the Stripe Plan ID from the previous step.5. Add the plan to a pageIf you generated a page in the previous step, your work here is done.&nbsp; You can see a sample generated page below.&nbsp; For plans, only the \"Buy Now Button\" widget works, because plans cannot be added to a cart.&nbsp; If you want to enable subscribing to a plan from another page simply add a \"Buy Now Button\" and select the product you created in the previous step from the contextual menu.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/setting-up-a-stripe-subscription",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "Matthew",
        "lastName": "Smith",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "location": "",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Creating a Site Admin",
        "description": "Learn how to specify site administrators in Respond.",
        "text": "Creating a Site Admin Learn how to specify site administrators in Respond. extensionComponent If you have access to the file system, you can specify a user as a site administrator.&nbsp; Navigate in your root installation directory to the \/resources\/sites\/users.json.&nbsp; Then, simply set the sysadmin boolean to true. { \"email\": \"sample@respondcms.com\", \"password\": \"HASHED_PASSWORD\", \"firstName\": \"Sample\", \"lastName\": \"Admin\", \"language\": \"en\", \"token\": \"\", \"sysadmin\": true, \"sites\": [] },",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/creating-a-site-admin",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "Matthew",
        "lastName": "Smith",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:30+0000",
        "template": "default",
        "location": "",
        "customHeader": "",
        "customFooter": ""
    },
    {
        "title": "Changing Background Images",
        "description": "Learn how to change background images.",
        "text": "Changing Background Images Learn how to change background images. Background images play an important part in the design of many of Respond's beautiful templates.&nbsp; This video walks you through how to quickly change background images. Your browser does not support the video tag.",
        "keywords": "",
        "tags": "",
        "callout": "",
        "url": "documentation\/changing-background-images",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "Matthew",
        "lastName": "Smith",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2018-06-30T12:12:29+0000",
        "template": "default",
        "location": "",
        "customHeader": "",
        "customFooter": ""
    }
]